Upon application:

With a valid `my.tfvars` file and `tfa -var-file="my.tfvars"`

```hcl
model           = "my-model"
charms = {
    alertmanager = {
        app_name    = "my-alertmanager"
        channel     = "1/edge"
        units     = 2
    }
    catalogue = {
        app_name    = "my-catalogue"
        channel     = "2/edge"
        units     = 1
    }
}
```

```
Terraform will perform the following actions:

  # module.alertmanager.juju_application.alertmanager will be created
  + resource "juju_application" "alertmanager" {
      + config             = {}
      + constraints        = "arch=amd64"
      + id                 = (known after apply)
      + machines           = (known after apply)
      + model              = "tls"
      + model_type         = (known after apply)
      + name               = "my-alertmanager"
      + placement          = (known after apply)
      + principal          = (known after apply)
      + storage            = (known after apply)
      + storage_directives = {}
      + trust              = true
      + units              = 2

      + charm {
          + base     = (known after apply)
          + channel  = "1/edge"
          + name     = "alertmanager-k8s"
          + revision = (known after apply)
          + series   = (known after apply)
        }
    }

  # module.catalogue.juju_application.catalogue will be created
  + resource "juju_application" "catalogue" {
      + config             = {}
      + constraints        = "arch=amd64"
      + id                 = (known after apply)
      + machines           = (known after apply)
      + model              = "tls"
      + model_type         = (known after apply)
      + name               = "my-catalogue"
      + placement          = (known after apply)
      + principal          = (known after apply)
      + storage            = (known after apply)
      + storage_directives = {}
      + trust              = true
      + units              = 1

      + charm {
          + base     = (known after apply)
          + channel  = "2/edge"
          + name     = "catalogue-k8s"
          + revision = (known after apply)
          + series   = (known after apply)
        }
    }
```

Showing that the `optional(something, default)` is working.